### Pre-processing: Restaurant data set

#### <font color= '#eb3483'> Imports and mounting to drive

In [ ]:
#imports 
import pandas as pd
import numpy as np
from google.colab import drive

In [ ]:
#Mount google drive
prefix = '/content/drive'
from google.colab import drive
drive.mount(prefix, force_remount=True)

Mounted at /content/drive

In [ ]:
path = '/content/drive/My Drive/Restaurants.csv.gz'

In [ ]:
#load data into a dataframe
#df = pd.read_csv(path, header=[0]) -- put this back in when it downloads to drive

df = pd.read_csv('Restaurants.csv', header=[0])

df.head(5)

      CAMIS                       DBA       BORO  ...        BIN           BBL   NTA
0  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
1  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
2  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
3  41089834         MURRAY HILL DINER  Manhattan  ...  1018492.0  1.008890e+09  MN20
4  40596549  POLLOS A LA BARASA MARIO     Queens  ...  4011093.0  4.006780e+09  QN70

[5 rows x 26 columns]

### <font color= '#eb3483'> Explore data types and values

In [ ]:
#explore types
df.dtypes

CAMIS                      int64
DBA                       object
BORO                      object
BUILDING                  object
STREET                    object
ZIPCODE                  float64
PHONE                     object
CUISINE DESCRIPTION      float64
INSPECTION DATE          float64
ACTION                    object
VIOLATION CODE           float64
VIOLATION DESCRIPTION    float64
CRITICAL FLAG            float64
SCORE                    float64
GRADE                    float64
GRADE DATE               float64
RECORD DATE              float64
INSPECTION TYPE          float64
Latitude                 float64
Longitude                float64
Community Board          float64
Council District         float64
Census Tract             float64
BIN                      float64
BBL                      float64
NTA                       object
dtype: object

In [ ]:
#look at all columns 
df.columns

Index(['CAMIS', 'DBA', 'BORO', 'BUILDING', 'STREET', 'ZIPCODE', 'PHONE',
       'CUISINE DESCRIPTION', 'INSPECTION DATE', 'ACTION', 'VIOLATION CODE',
       'VIOLATION DESCRIPTION', 'CRITICAL FLAG', 'SCORE', 'GRADE',
       'GRADE DATE', 'RECORD DATE', 'INSPECTION TYPE', 'Latitude', 'Longitude',
       'Community Board', 'Council District', 'Census Tract', 'BIN', 'BBL',
       'NTA'],
      dtype='object')

In [ ]:
#look at shape
df.shape

(333486, 26)

In [ ]:
#how many unique values do we have
df.apply('nunique').sort_values(ascending=True)[0:30]

CRITICAL FLAG                0
INSPECTION TYPE              0
RECORD DATE                  0
GRADE DATE                   0
CUISINE DESCRIPTION          0
INSPECTION DATE              0
VIOLATION CODE               0
VIOLATION DESCRIPTION        0
GRADE                        0
BORO                         6
ACTION                      13
Council District            51
Community Board             69
SCORE                      136
NTA                        193
ZIPCODE                    228
Census Tract              1189
STREET                    2382
BUILDING                  7977
BBL                      19563
BIN                      19884
DBA                      22114
Latitude                 22867
Longitude                22867
PHONE                    26353
CAMIS                    28395
dtype: int64

In [ ]:
#remove duplicates
df.drop_duplicates(inplace=True)

In [ ]:
#look at shape
df.shape

(113905, 26)

In [ ]:
df.head(5)

       CAMIS                       DBA  ...           BBL   NTA
0   41089834         MURRAY HILL DINER  ...  1.008890e+09  MN20
4   40596549  POLLOS A LA BARASA MARIO  ...  4.006780e+09  QN70
7   40530583         CORNER GOURMET II  ...  1.001320e+09  MN24
8   50074520        EL POLLO INKA PERU  ...  4.090930e+09  QN53
16  40367241       JG MELON RESTAURANT  ...  1.014290e+09  MN31

[5 rows x 26 columns]

In [ ]:
#only keep certain columns based on what we need
keep = [
        'CAMIS', 'DBA', 'BORO', 'ZIPCODE', 
        'PHONE', 'CUISINE DESCRIPTION', 'Latitude',
        'Longitude'
]
df = df[keep]

In [ ]:
df.head(5)

       CAMIS                       DBA  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 8 columns]

In [ ]:
#drop duplicates again
df.drop_duplicates(inplace=True)

In [ ]:
#now look at unique values of what we have
df.apply('nunique').sort_values(ascending=False)

CAMIS                  28395
PHONE                  26353
Longitude              22867
Latitude               22867
DBA                    22114
ZIPCODE                  228
BORO                       6
CUISINE DESCRIPTION        0
dtype: int64

In [ ]:
#look at shape
df.shape

(28395, 8)

In [ ]:
#look at percent null values 
df.isna().sum() * 100 / df.shape[0]

CAMIS                    0.000000
DBA                      2.630745
BORO                     0.000000
ZIPCODE                  1.760873
PHONE                    0.014087
CUISINE DESCRIPTION    100.000000
Latitude                 0.246522
Longitude                0.246522
dtype: float64

#### <font color= pink> Column: CAMIS

In [ ]:
#rename CAMIS to be more easily readable
df.rename(columns={'CAMIS': 'id'}, inplace=True)

In [ ]:
df.head(5)

          id                       DBA  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 8 columns]

#### <font color= pink> Column: DBA

In [ ]:
#rename DBA to be more easily readable
df.rename(columns={'DBA': 'name'}, inplace=True)

In [ ]:
df.head(5)

          id                      name  ...   Latitude  Longitude
0   41089834         MURRAY HILL DINER  ...  40.745891 -73.980104
4   40596549  POLLOS A LA BARASA MARIO  ...  40.758872 -73.918772
7   40530583         CORNER GOURMET II  ...  40.714643 -74.009934
8   50074520        EL POLLO INKA PERU  ...  40.682864 -73.850875
16  40367241       JG MELON RESTAURANT  ...  40.771193 -73.959532

[5 rows x 8 columns]

In [ ]:
#make values title capitalization
df.name.str.title()

0                Murray Hill Diner
4         Pollos A La Barasa Mario
7                Corner Gourmet Ii
8               El Pollo Inka Peru
16             Jg Melon Restaurant
                    ...
333429              Sushi On Jones
333439            The Green Bottle
333447           Aberia Grill Cafe
333456                       Spudz
333485             Rainbow Dim Sum
Name: name, Length: 28395, dtype: object

In [ ]:
df.name.isna().sum()

747

Do we want to drop restaurants with no name?

#### <font color= pink> Column: BORO

In [ ]:
#rename DBA to be more easily readable
df.rename(columns={'BORO': 'borough'}, inplace=True)

In [ ]:
df.borough.isna().sum()

0

#### <font color= pink> Column: ZIPCODE

In [ ]:
#rename DBA to be more easily readable
df.rename(columns={'ZIPCODE': 'zipcode'}, inplace=True)

In [ ]:
df.zipcode.isna().sum()

500

Do we want to drop restaurants with no zip code?

#### <font color= pink> Column: CUISINE DESCRIPTION

In [ ]:
#rename DBA to be more easily readable
df.rename(columns={'CUISINE DESCRIPTION': 'description'}, inplace=True)

In [ ]:
df.description.isna().sum()

28395

Right now all of these values are null, so we need to figure out a way to somehow link restaurant descriptions in here.

#### <font color= pink> Column: Latitude

In [ ]:
#rename Latitude to be more easily readable
df.rename(columns={'Latitude': 'latitude'}, inplace=True)

In [ ]:
df.latitude.isna().sum()

70

Since there are only 83 null latitude values and we need latitude in order to be able to put restaurants on a map, we will just drop instances with null latitudes.

In [ ]:
#drop where latitude is null
df.dropna(subset=['latitude'], inplace=True)

In [ ]:
df.latitude.isna().sum()

0

#### <font color= pink> Column: Longitude

In [ ]:
#rename Longitude to be more easily readable
df.rename(columns={'Longitude': 'longitude'}, inplace=True)

In [ ]:
df.longitude.isna().sum()

0